app/controllers/pages_controller.rb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."requiring_user_id" = $1 AND "tickets"."state" = $2  [["requiring_user_id", 8], ["state", "opened"]]
SELECT "responses".* FROM "responses" WHERE "responses"."requiring_user_id" = $1 AND "responses"."acceptance" = $2  [["requiring_user_id", 8], ["acceptance", false]]
---
    def home
        if current_user.role == "requiring_user"
            @tickets = current_user.requiring_user_tickets
            @opened_tickets = @tickets.where(state: "open")
            @pending_responses = current_user.requiring_user_responses.where(acceptance: false)