app/models/user.rb

    def only_one_administrator
        if role == "administrator"
            if User.exists?(role: "administrator")
---
SELECT 1 AS one FROM "users" WHERE "users"."role" = $1 LIMIT $2  [["role", 3], ["LIMIT", 1]]